app/controllers/products_controller.rb

    def create
      @product = Product.new(product_params)

      if @product.save
---
INSERT INTO "products" ("productname", "price", "description", "qty", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "qty" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["qty", 40], ["updated_at", "2023-11-10 05:18:35.557066"], ["id", 1]]